results/node/vus_50/rep_1/k6_security_stdout.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/security.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 45s max duration (incl. graceful stop):
              * default: 10 looping VUs for 15s (gracefulStop: 30s)


running (01.0s), 10/10 VUs, 100 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  01.0s/15s

running (02.0s), 10/10 VUs, 283 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  02.0s/15s

running (03.0s), 10/10 VUs, 469 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  03.0s/15s

running (04.0s), 10/10 VUs, 650 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  04.0s/15s

running (05.0s), 10/10 VUs, 832 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  05.0s/15s

running (06.0s), 10/10 VUs, 1011 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  06.0s/15s

running (07.0s), 10/10 VUs, 1199 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  07.0s/15s

running (08.0s), 10/10 VUs, 1386 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  08.0s/15s

running (09.0s), 10/10 VUs, 1571 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  09.0s/15s

running (10.0s), 10/10 VUs, 1764 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  10.0s/15s

running (11.0s), 10/10 VUs, 1953 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  11.0s/15s

running (12.0s), 10/10 VUs, 2142 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  12.0s/15s

running (13.0s), 10/10 VUs, 2327 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  13.0s/15s

running (14.0s), 10/10 VUs, 2504 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  14.0s/15s

running (15.0s), 10/10 VUs, 2688 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  15.0s/15s


  █ TOTAL RESULTS 

    checks_total.......: 8097    538.31623/s
    checks_succeeded...: 100.00% 8097 out of 8097
    checks_failed......: 0.00%   0 out of 8097

    ✓ net: got 200
    ✓ env: endpoint ok
    ✓ fs: responded

    HTTP
    http_req_duration..............: avg=18.46ms min=158.15µs med=946.72µs max=587.47ms p(90)=59ms    p(95)=61.51ms
      { expected_response:true }...: avg=18.46ms min=158.15µs med=946.72µs max=587.47ms p(90)=59ms    p(95)=61.51ms
    http_req_failed................: 0.00%  0 out of 8097
    http_reqs......................: 8097   538.31623/s

    EXECUTION
    iteration_duration.............: avg=55.64ms min=27.44ms  med=58.75ms  max=591.35ms p(90)=66.13ms p(95)=69.56ms
    iterations.....................: 2699   179.438743/s
    vus............................: 10     min=10        max=10
    vus_max........................: 10     min=10        max=10

    NETWORK
    data_received..................: 2.1 MB 139 kB/s
    data_sent......................: 629 kB 42 kB/s



running (15.0s), 00/10 VUs, 2699 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  15s